"""Модуль создания меню приложения"""

def main_menu():
    """Функция создания главного меню приложения"""
    text = """
==================
STTL_HELPER v1.0.0
==================

1. Скачать манифесты.
2. Утилиты.
3. Настройки.
0. Выход.
==================
    """

    choices = [1,2,3,0]
    return text, choices

def settings_menu():
    """Функция создания меню настроек"""
    text = """
==================================================================
1. Путь к папке с манифестами.( по умолчанию: папка с программой )
2. Путь к папке с распакованными манифестами.
==================================================================
    """

    choices = [1]
    return text, choices

def utils_menu():
    """Функция создания меню утилит"""
    